package ua.kpi;

public class Main {

    public static void main(String[] args) {
        Model model = new Model(2, 1, 5);
        model.simulate(1000, true);

        //==== змінили час створення заявки
        //зменшили
        model = new Model(1, 1, 5);// збільш завантаження черги, ймовірність відмови збільш, сер довжина черги збільш, сер час очікув збільш
        model.simulate(1000, false);

        //збільшили
        model = new Model(4, 1, 5);// зменщення завантаж черги, ймовірність відмови зменш, сер довжина черги зменш, сер час очікув зменш
        model.simulate(1000, false);

        //==== змінили час обслуговування заявки
        //зменшили
        model = new Model(2, 0.5, 5);// зменшення завантаження черги, ймовірність відмови зменш,  сер довжина черги зменш, зменшується середній час очікування,
        model.simulate(1000, false);

        //збільшили
        model = new Model(2, 4, 5);// збільш завантаження черги, ймовірність відмови збільш,  сер довжина черги збільш, збільш середній час очікування,
        model.simulate(1000, false);

        //==== змінили максимальну довжину черги
        //зменшити
        model = new Model(2, 1, 2);// збільш завантаження черги, ймовірність відмови збільш,  сер довжина черги збільш, збільш середній час очікування
        model.simulate(1000, false);

        //збільшити
        model = new Model(2, 1, 10);// збільш завантаження черги, ймовірність відмови зменш,  сер довжина черги збільш, збільш середній час очікування,
        model.simulate(1000, false);
    }
}
